{
    "intents": [
      {
        "tag": "greeting",
        "question": ["Hi there!", "Hello!", "Good day!", "Hey!", "Greetings!", "Jambo!", "Habari!", "Sasa?", "Shikamoo!"],
        "responses": ["Hello, welcome to Shopzetu, our clothing store!", "Hi there, how can I assist you?", "Good day! How may I help you?", "Hey! How can I make your shopping experience better?", "Greetings! How can I assist with your clothing needs?", "Jambo! Karibu kwenye duka letu la nguo la Shopzetu!", "Habari! Unahitaji msaada gani?", "Sasa? Tunawezaje kukusaidia?", "Shikamoo! Tuko hapa kuhudumia mahitaji yako ya nguo!"],
        "context_set": ""
      },
      {
        "tag": "goodbye",
        "question": ["Goodbye!", "See you later!", "Bye!", "Take care!", "Kwaheri!", "Tutaonana!", "Baadaye!", "Jiweke!"],
        "responses": ["Goodbye! Have a wonderful day!", "See you later! Happy shopping at Shopzetu!", "Bye! Come back soon for more fashion!", "Take care! We look forward to serving you again at Shopzetu!", "Kwaheri! Uwe na siku njema!", "Tutaonana! Karibu tena Shopzetu!", "Baadaye! Karibu tena Shopzetu!", "Jiweke! Tunakusubiri urudi tena Shopzetu!"]
      },
      {
        "tag": "help",
        "question": ["Help me!", "I need assistance!", "Can you help?", "Support, please!", "Nisaidie!", "Nahitaji msaada!", "Unaweza kunisaidia?", "Tafadhali nisaidie!"],
        "responses": ["Sure, I'm here to help! What do you need?", "Of course! Let me know how I can assist you at Shopzetu.", "Absolutely, how can I be of service at Shopzetu?", "Don't worry, I'm here to provide support at Shopzetu.", "Hakika, tuko hapa kusaidia! Unahitaji nini?", "Bila shaka! Niambie ninaweza kukusaidia vipi katika Shopzetu.", "Kabisa, niko hapa kusaidia. Unahitaji nini katika Shopzetu?", "Usiwe na wasiwasi, nipo hapa kutoa msaada katika Shopzetu."]
      },
      {
        "tag": "browse",
        "question": ["What clothing options do you have?", "Show me what's available", "What can I shop?", "Browse your collection.", "Je, una chaguzi za nguo zipi?", "Nionyeshe zilizopo", "Ninaweza kununua nini?", "Angalia mkusanyo wako."],
        "responses": ["We have a wide range of clothing options, including dresses, shirts, pants, and more at Shopzetu. Feel free to browse our collection!", "Explore our latest collection of trendy clothing, from casual wear to formal attire, available at Shopzetu!", "Our collection features various styles and sizes to suit your fashion preferences at Shopzetu.", "Tuna chaguzi nyingi za nguo, kama vile nguo za kike, za kiume, suruali, na zingine katika Shopzetu. Jisikie huru kuangalia mkusanyo wetu!", "Pitia mkusanyo wetu wa nguo za kisasa, kutoka kuvaa kawaida hadi vazi la kufana, Shopzetu!", "Mkusanyo wetu una mitindo na ukubwa mbalimbali kukidhi mapendekezo yako ya fesheni katika Shopzetu."]
      },
      {
        "tag": "sizes",
        "question": ["What sizes do you offer?", "How do I find my size?", "Do you have plus sizes?", "Size options available?", "Mna vipi vya ukubwa?", "Vipi naweza kupata ukubwa wangu?", "Je, mna vipi vya ukubwa wa ziada?", "Vipi vyenye ukubwa wa heshima vipo?"],
        "responses": ["We offer a diverse range of sizes, from XS to XXXL, to cater to all body types at Shopzetu.", "You can find your size by using our size chart, which provides measurements and guidance for a perfect fit at Shopzetu.", "Yes, we have a great selection of plus sizes for our inclusive customers at Shopzetu!", "We strive to offer a wide variety of sizes to ensure everyone finds their perfect fit at Shopzetu.", "Tunatoa ukubwa mbalimbali, kuanzia XS hadi XXXL, ili kukidhi aina zote za miili katika Shopzetu.", "Unaweza kupata ukubwa wako kwa kutumia chati yetu ya ukubwa, ambayo inatoa vipimo na mwongozo wa kufikia ukubwa kamili katika Shopzetu.", "Ndiyo, tuna chaguzi nzuri za ukubwa wa ziada kwa wateja wetu wa kila aina katika Shopzetu!", "Tunajitahidi kutoa ukubwa mbalimbali ili kila mtu apate ukubwa unaofaa kwake katika Shopzetu."]
      },
      {
        "tag": "shipping",
        "question": ["How long does shipping take?", "What are your shipping options?", "Do you offer express shipping?", "Shipping timeframes?", "Kiasi gani cha muda usafirishaji huchukua?", "Je, mna chaguzi za usafirishaji?", "Mna usafirishaji wa haraka?", "Muda gani wa usafirishaji?"],
        "responses": ["Shipping times vary based on your location and selected shipping method. We offer standard and express shipping options for your convenience at Shopzetu.", "Standard shipping usually takes X-XX business days, while express shipping delivers within X business days at Shopzetu.", "Yes, we offer express shipping for those who need their orders delivered quickly at Shopzetu!", "During checkout, you can choose the shipping method that suits your delivery needs at Shopzetu.", "Muda wa usafirishaji hutofautiana kulingana na eneo lako na njia ya usafirishaji uliyochagua katika Shopzetu. Tunatoa chaguzi za usafirishaji wa kawaida na haraka kwa urahisi wako.", "Usafirishaji wa kawaida kawaida huchukua siku X-XX za biashara, wakati usafirishaji wa haraka hufika ndani ya siku X za biashara katika Shopzetu.", "Ndiyo, tunatoa usafirishaji wa haraka kwa wale wanaohitaji agizo lao lifike haraka katika Shopzetu!", "Wakati wa usafirishaji unaweza kuchaguliwa wakati wa kufanya malipo, ili uweze kuchagua njia inayokidhi mahitaji yako katika Shopzetu."]
      },
      {
        "tag": "returns",
        "question": ["What's your return policy?", "Can I return or exchange items?", "How do returns work?", "Return eligibility?", "Sera yenu ya kurejesha ni ipi?", "Je, naweza kurudisha au kubadilisha vitu?", "Jinsi ya kurejesha vitu?", "Vigezo vya kurejesha?"],
        "responses": ["We want you to be satisfied with your purchase. You can initiate a return or exchange within X days of receiving your order. Please check our Return Policy for more details at Shopzetu.", "Yes, you can return or exchange items within X days if they meet our return criteria. We want you to be happy with your clothing at Shopzetu!", "Returns are easy! Just follow the instructions in our Return Policy to start the process at Shopzetu.", "For eligible items, we gladly accept returns and exchanges within X days of purchase at Shopzetu.", "Tunataka uwe na furaha na ununuzi wako. Unaweza kuanzisha kurejesha au kubadilishana vitu ndani ya siku X tangu upokee agizo lako. Tafadhali angalia Sera yetu ya Kurejesha kwa maelezo zaidi katika Shopzetu.", "Ndiyo, unaweza kurejesha au kubadilishana vitu ndani ya siku X ikiwa vinakidhi vigezo vya kurejesha. Tunataka uwe na furaha na nguo zako katika Shopzetu!", "Kurejesha ni rahisi! Fuata tu maelekezo katika Sera yetu ya Kurejesha ili kuanza mchakato katika Shopzetu.", "Tunakubali kurejesha na kubadilishana kwa vitu vinavyostahiki ndani ya siku X tangu ununuzi katika Shopzetu."]
      },
      {
        "tag": "sales",
        "question": ["Are there any ongoing sales?", "Do you offer discounts?", "Can I get a discount?", "Sales and promotions?", "Kuna mauzo yanayoendelea?", "Je, mnatoa punguzo?", "Naweza kupata punguzo?", "Mauzo na matangazo?"],
        "responses": ["Yes, we often have special sales and promotions at Shopzetu. Keep an eye on our website for the latest discounts!", "Discounts and offers are available from time to time at Shopzetu. Don't miss out on our exclusive deals!", "Discounts may be available on selected items or during special events. Check out our website for current promotions at Shopzetu.", "Stay tuned for our seasonal sales and limited-time offers on your favorite clothing at Shopzetu!", "Ndiyo, tunazo mara nyingi mauzo na matangazo maalum katika Shopzetu. Endelea kutazama tovuti yetu kwa punguzo za hivi karibuni!", "Punguzo na ofa zinapatikana wakati wa wakati katika Shopzetu. Usipitwe na ofa zetu za kipekee!", "Punguzo linaweza kupatikana kwa baadhi ya vitu au wakati wa matukio maalum. Angalia tovuti yetu kwa matangazo ya sasa katika Shopzetu.", "Tunayo mauzo ya msimu na ofa za muda maalum kwenye nguo zako pendwa katika Shopzetu."]
      },
      {
        "tag": "contact",
        "question": ["How do I contact customer support?", "Need help with my order", "Questions or concerns", "Contact information", "Nawezaje kuwasiliana na msaada kwa wateja?", "Nahitaji msaada na agizo langu", "Maswali au wasiwasi", "Maelezo ya mawasiliano?"],
        "responses": ["If you need assistance, you can contact our customer support team via email at support@shopzetu.com or call us at +1-800-123-4567.", "For help with your order or any questions, feel free to reach out to our dedicated customer support team.", "Your satisfaction is our priority. If you have any concerns or queries, our customer support team is here to assist.", "For any inquiries or assistance, you can find our contact information on the 'Contact Us' page at Shopzetu.", "Ikiwa unahitaji msaada, unaweza kuwasiliana na timu yetu ya msaada kwa wateja kupitia barua pepe kwa support@shopzetu.com au kupiga simu kwa +1-800-123-4567.", "Kwa msaada na agizo lako au maswali yoyote, tafadhali wasiliana na timu yetu ya msaada kwa wateja.", "Kuridhika kwako ndio kipaumbele chetu. Ikiwa una wasiwasi au maswali yoyote, timu yetu ya msaada kwa wateja ipo hapa kusaidia.", "Kwa maswali au msaada wowote, unaweza kupata maelezo yetu ya mawasiliano kwenye ukurasa wa 'Wasiliana Nasi' katika Shopzetu."]
      },
      {
        "tag": "product_info",
        "question": ["Tell me about a product", "What are the features of this item?", "Product details", "Can you describe this product?", "Nipe maelezo ya bidhaa", "Je, bidhaa hii ina sifa gani?", "Maelezo ya bidhaa", "Unaweza kuelezea bidhaa hii?"],
        "responses": ["Sure! Our products are carefully curated with the latest fashion trends in mind. Let me provide you with more information about this item.", "Absolutely! This product features high-quality materials and stylish design. Here are the details.", "Tunajali kuchagua bidhaa zetu kwa kuzingatia mitindo ya hivi karibuni. Hebu nikupatie maelezo zaidi kuhusu bidhaa hii.", "Kabisa! Bidhaa hii ina vifaa bora na muundo wenye mtindo. Hapa kuna maelezo zaidi."],
        "context_set": ""
      },
      {
        "tag": "seller_info",
        "question": ["How can I become a seller?", "Join as a seller", "Seller registration", "Sell my products on Shopzetu", "Nawezaje kuwa muuzaji?", "Jiunge kama muuzaji", "Usajili wa muuzaji", "Niuze bidhaa zangu kwenye Shopzetu"],
        "responses": ["Thank you for your interest in becoming a seller on Shopzetu! To get started, please visit our 'Sell with Us' page for more details on the registration process.", "We welcome you to join Shopzetu as a seller! The seller registration process is simple. You can find more information on our 'Sell with Us' page.", "Asante kwa kuonyesha nia ya kuwa muuzaji kwenye Shopzetu! Kuanza, tafadhali tembelea ukurasa wetu wa 'Uza Pamoja Nasi' kwa maelezo zaidi kuhusu mchakato wa usajili.", "Karibu ujiunge na Shopzetu kama muuzaji! Mchakato wa usajili wa muuzaji ni rahisi. Unaweza kupata maelezo zaidi kwenye ukurasa wetu wa 'Uza Pamoja Nasi'."],
        "context_set": ""
      },
      {
        "tag": "order_status",
        "question": ["Where is my order?", "Track my order", "Check order status", "How do I know if my order has shipped?", "Agizo langu lipo wapi?", "Fuata agizo langu", "Angalia hali ya agizo", "Ninawezaje kujua kama agizo langu limepelekwa?"],
        "responses": ["I can help you with that! Please provide your order number, and I'll check the status for you.", "Sure, let me assist you in tracking your order. Please share your order number.", "To check the status of your order, please provide your order number, and I'll find the latest information for you.", "Naweza kukusaidia! Tafadhali nipe nambari ya agizo lako, nitachunguza hali kwa ajili yako.", "Hakika, nitaangalia kufuatilia agizo lako. Tafadhali toa nambari yako ya agizo.", "Kuangalia hali ya agizo lako, tafadhali nipe nambari yako ya agizo, nitapata taarifa za hivi karibuni kwa ajili yako."],
        "context_set": ""
      },
      {
        "tag": "best_deals",
        "question": ["Show me the best deals", "Any special offers?", "Deals and discounts", "Where can I find your current promotions?", "Nionyeshe ofa bora zaidi", "Kuna ofa maalum?", "Mauzo na punguzo", "Wapi naweza kupata matangazo yenu ya sasa?"],
        "responses": ["You're in for a treat! Check out our 'Best Deals' section for the latest special offers and discounts.", "We have some fantastic deals and discounts available right now. Visit our 'Best Deals' section to find them all.", "We're currently offering exciting deals and discounts on selected items. Don't miss out on the savings in our 'Best Deals' section.", "Unafurahia ofa maalum! Angalia sehemu yetu ya 'Ofa Bora' kwa matangazo na punguzo ya hivi karibuni.", "Tuna ofa nzuri sana na punguzo zinazopatikana sasa. Tembelea sehemu yetu ya 'Ofa Bora' ili kuzipata zote.", "Tunatoa ofa na punguzo za kusisimua kwenye vitu vyote. Usipitwe na matangazo yetu ya sasa katika sehemu yetu ya 'Ofa Bora'."],
        "context_set": ""
      },
      {
        "tag": "fashion_tips",
        "question": ["Can you give me some fashion tips?", "How can I style this outfit?", "Fashion inspiration", "What's trending in fashion?", "Naweza kupata ushauri wa mtindo?", "Nifanyaje mtindo na vazi hili?", "Chanzo cha mitindo ya fasheni", "Nini kinachotrendi katika fasheni?"],
        "responses": ["Of course! Here are some fashion tips to help you rock your outfit: (Provide fashion tips here).", "Styling is fun! Let me share some tips to enhance your outfit and create a stylish look: (Provide fashion tips here).", "Looking for fashion inspiration? Check out our blog for the latest trends and style guides.", "Fashion trends change constantly. Stay up-to-date with the latest fashion trends by following our blog and social media.", "Kwa hakika! Hapa kuna ushauri wa mitindo ya kusaidia kuwa bora katika vazi lako: (Toa ushauri wa mitindo hapa).", "Kufanya mtindo ni furaha! Hebu nikushirikishe baadhi ya vidokezo kuboresha vazi lako na kuunda mtindo wenye mvuto: (Toa ushauri wa mitindo hapa).", "Unatafuta chanzo cha mitindo ya fasheni? Angalia blog yetu kwa mitindo ya hivi karibuni na mwongozo wa mitindo.", "Mitindo ya fasheni hubadilika mara kwa mara. Kuwa na taarifa zilizoboreshwa kuhusu mitindo ya fasheni kwa kufuata blog yetu na mitandao ya kijamii."]
      },
      {
        "tag": "new_arrivals",
        "question": ["What are the new arrivals?", "Show me the latest products", "New in stock", "What's fresh?", "Vitu vipya ni vipi?", "Nionyeshe bidhaa za hivi karibuni", "Vitu vipya vipo?", "Ni nini kipya?"],
        "responses": ["Check out our latest arrivals section to see the newest products added to our collection.", "Explore our 'New Arrivals' category for the freshest additions to our fashion collection.", "Discover the latest in stock! Our 'New Arrivals' section features the newest clothing items.", "We constantly update our collection with fresh arrivals. Visit our 'New Arrivals' category for the latest products.", "Angalia sehemu yetu ya vitu vipya ili uone bidhaa za hivi karibuni zilizoongezwa kwenye mkusanyiko wetu.", "Gundua vito vya hivi karibuni! Sehemu yetu ya 'Vitu Vipya' inaonyesha bidhaa mpya zaidi za nguo.", "Tunaboresha mkusanyiko wetu mara kwa mara na vitu vipya. Tembelea sehemu yetu ya 'Vitu Vipya' kwa bidhaa za hivi karibuni.", "Tunapata vitu vipya mara kwa mara. Tembelea sehemu yetu ya 'Vitu Vipya' kwa bidhaa za hivi karibuni."]
      },
      {
        "tag": "out_of_stock",
        "question": ["Is this item out of stock?", "When will this product be restocked?", "Availability of a product", "Do you have this in stock?", "Je, bidhaa hii iko nje ya hisa?", "Bidhaa hii itakuwa na hisa lini?", "Upatikanaji wa bidhaa", "Je, mnayo bidhaa hii kwenye hisa?"],
        "responses": ["I apologize, but it seems that this item is currently out of stock. Please check back later or explore our other products.", "The item you're looking for might be temporarily out of stock. We'll restock it as soon as possible.", "I'm sorry, the availability of this product is currently limited. You can consider our other fashionable options.", "We are currently out of stock for this item. We are working to restock it soon. In the meantime, take a look at our other amazing products.", "Samahani, inaonekana bidhaa hii iko nje ya hisa kwa sasa. Tafadhali rudi tena au angalia bidhaa zetu nyingine.", "Inaonekana bidhaa unayotafuta iko nje ya hisa kwa sasa. Tutaiweka hisa tena haraka iwezekanavyo.", "Samahani, upatikanaji wa bidhaa hii ni mdogo kwa sasa. Unaweza kuzingatia chaguzi zetu za fasheni nyingine.", "Kwa sasa hatuna bidhaa hii kwenye hisa. Tunafanya kazi kuiweka tena hisa haraka iwezekanavyo. Kwa wakati huo, angalia bidhaa zetu zingine za kuvutia."]
      },
      {
        "tag": "gift_cards",
        "question": ["Do you offer gift cards?", "Can I purchase a gift card?", "Gift card options", "How do gift cards work?", "Je, mnatoa kadi za zawadi?", "Naweza kununua kadi ya zawadi?", "Chaguzi za kadi za zawadi", "Kadi za zawadi zinafanyaje kazi?"],
        "responses": ["Yes, we offer gift cards that make perfect presents for your loved ones. You can purchase them on our website and send them via email.", "Absolutely! Our gift cards are a great way to surprise someone special. They are available for purchase online and can be delivered via email.", "We have various gift card options to suit different occasions and budgets. Explore our website for the available choices.", "Gift cards are a wonderful way to let someone choose their own perfect outfit. You can purchase them online, and the recipient will receive it via email with instructions on how to use it during checkout.", "Ndiyo, tunatoa kadi za zawadi ambazo ni zawadi kamili kwa wapendwa wako. Unaweza kununua kadi hizo kwenye tovuti yetu na kuzituma kupitia barua pepe.", "Kabisa! Kadi zetu za zawadi ni njia nzuri ya kumshangaza mtu maalum. Zinapatikana kwa ununuzi mkondoni na zinaweza kutumwa kupitia barua pepe.", "Tuna chaguzi mbalimbali za kadi za zawadi ili kukidhi hafla na bajeti tofauti. Angalia tovuti yetu kwa chaguzi zinazopatikana.", "Kadi za zawadi ni njia nzuri ya kumruhusu mtu achague vazi linalofaa kwake mwenyewe. Unaweza kununua kadi hizo mkondoni, na mpokeaji atazipokea kupitia barua pepe pamoja na maelekezo ya jinsi ya kuzitumia wakati wa kufanya malipo."]
      },
      {
        "tag": "size_guide",
        "question": ["How do I find my size?", "What size should I choose?", "Size chart", "Guide for sizing", "Vipi naweza kupata ukubwa wangu?", "Ningechagua ukubwa upi?", "Chati ya ukubwa", "Mwongozo wa kuchagua ukubwa"],
        "responses": ["To find your perfect size, refer to our size chart, which provides measurements for various clothing items.", "Choosing the right size is essential for a comfortable fit. Our size chart will help you find the ideal size for your body measurements.", "Check our size chart for accurate sizing information on different products. It ensures you get the best fit possible.", "Selecting the right size ensures a flattering look. Our size chart offers detailed measurements to assist you.", "Kupata ukubwa wako kamili, rejea chati yetu ya ukubwa, ambayo inatoa vipimo vya bidhaa za nguo mbalimbali.", "Kuchagua ukubwa sahihi ni muhimu kwa kuvaa vizuri. Chati yetu ya ukubwa itakusaidia kupata ukubwa bora kulingana na vipimo vya mwili wako.", "Angalia chati yetu ya ukubwa kwa habari sahihi za ukubwa kwenye bidhaa mbalimbali. Inahakikisha unapata ukubwa bora.", "Kuchagua ukubwa sahihi kunahakikisha kuonekana vizuri. Chati yetu ya ukubwa inatoa vipimo vya kina kukusaidia."]
      }
    ]
  }